content/posts/software_engineering.md
+++
title = "Software Engineering"
author = ["Derrick Chua", "Jethro Kuan"]
draft = false
+++

## Object-Oriented Programming {#object-oriented-programming}

-   Every object has both _state_ (data) and _behaviour_ (operations on
    data).
-   Every object has an _interface_ and an _implementation_.
    -   Interface are for other objects to interact with.
    -   Implementations support the interface, and may not be accessible
        to other objects.


### Basic UML Notation {#basic-uml-notation}

The class is denoted with 3 parts: The class name, its attributes, and
its methods.
